getitem.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
  <soap:Header>
    <t:RequestServerVersion Version="Exchange2010" />
  </soap:Header>
  <soap:Body>
    <GetItem
      xmlns="http://schemas.microsoft.com/exchange/services/2006/messages"
      xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
      <ItemShape>
        <t:BaseShape>Default</t:BaseShape>
        <t:IncludeMimeContent>true</t:IncludeMimeContent>
      </ItemShape>
      <ItemIds>
        <!--
<t:ItemId Id="AAMkADg5MmFjNTViLTYwODUtNGNmYi04MzhjLTczZTdkOTZmYjllNwBGAAAAAABFQx5qtI0+R7P3jIlj8lBrBwCGvs35WFEvTaNeDfAlU93XAAAAFfBdAACGvs35WFEvTaNeDfAlU93XAAAAFsfQAAA=" ChangeKey="CQAAABYAAACGvs35WFEvTaNeDfAlU93XAAAAFuV8"/>
-->
        <t:ItemId Id="AAMkADg5MmFjNTViLTYwODUtNGNmYi04MzhjLTczZTdkOTZmYjllNwBGAAAAAABFQx5qtI0+R7P3jIlj8lBrBwCGvs35WFEvTaNeDfAlU93XAAAAFfBdAACGvs35WFEvTaNeDfAlU93XAAAAFsfQAAA="/>
      </ItemIds>
    </GetItem>
  </soap:Body>
</soap:Envelope>
